import { IDishGroup } from "../@types/dish.type";

export const dishesHardcodedList: IDishGroup[] = [
  {
    groupTitle: "Мёд",
    id: "hot-dishes",
    dishes: [
      {
        id: 5,
        title: "Крем Мёд",
        description: "Мёд богат естественной глюкозой и фруктозой, витаминами В1, В2, В6, Е, К, С, провитамина А-каротин и фолиевой кислотой.",
        price: 1100,
        image: "https://i.ibb.co/bHYr3xv/Screenshot-20210427-185646.jpg",
        detailedDescription:
          "Кремовый мед!!! Такое вы врядли пробовали! <br /><br /> Это наш Лепсинский, цветочный мед взбитый особым способом. Без нагрева! Просто кристаллы густого меда очень измельчены и получился совсем другой вкус меда! По консистенции похож на сгущенку и многим кажется вкуснее обычного меда! Особенно дети уплетают Кремовый мед легко мажется на хлеб, нежный как бархат, а вкусный нереально ! Полезные вещества все сохранены! Чтобы нежность и конссистенция сохранялась, обязательно держите банки в холодильнике ! Мёд является древнейшим целебным средством, он повышает иммунитет, обладает общеукрепляющими свойствами! Только натуральный мед наполнит ваш организм энергией, силой, здоровьем <br /><br /> Мёд богат естественной глюкозой и фруктозой, витаминами В1, В2, В6, Е, К, С, провитамина А-каротин и фолиевой кислотой.",
      },
      {
        id: 6,
        title: "Финики с орехами в меду",
        description: "Кукурузные чипсы, сырный соус, гуакомоле, сальса, специи",
        price: 3510,
        image: "https://i.ibb.co/D9f2z3t/Screenshot-20210427-185724.jpg",
      },

      {
        id: 7,
        title: "Грецкие орехи в меду",
        description: "Жареная цветная капуста в остром соусе баффало",
        price: 1100,
        image: "https://i.ibb.co/yh2ffPK/Screenshot-20210427-185618.jpg",
      },
      {
        id: 8,
        title: "Миндаль в меду",
        description: "Жареная цветная капуста в остром соусе баффало",
        price: 1100,
        image: "https://i.ibb.co/z7KQ74f/Screenshot-20210427-185524.jpg",
      },
    ],
  },
  {
    groupTitle: "Варенье",
    id: "combo",
    dishes: [
      {
        id: 1,
        title: "Малина-Клюква",
        description: "2 пиццы + Coca-cola 1L",
        price: 5400,
        image: "https://i.ibb.co/ck7GqTf/Screenshot-20210427-185410-01.jpg",
      },
      {
        id: 2,
        title: "Яблочное варенье",
        description: "2 твистера+пицца+2 напитка на выбор",
        price: 2220,
        image: "https://i.ibb.co/gmbHcN3/Screenshot-20210427-185323.jpg",
      },
      {
        id: 3,
        title: "Лимонное варенье",
        description: "2 бургера+пицца+2 закуски+Coca-cola 1L",
        price: 4490,
        image: "https://i.ibb.co/44QwcsN/Screenshot-20210427-185158.jpg",
      },
      {
        id: 4,
        title: "Черничное варенье",
        description: "2 бургера+пицца+2 закуски+Coca-cola 1L",
        price: 4490,
        image: "https://i.ibb.co/DVj9xjM/Screenshot-20210427-185221.jpg",
      },
    ],
  },
  {
    groupTitle: "Витамины",
    id: "burgers",
    dishes: [
      {
        id: 9,
        title: "Витаминная смесь",
        description:
          "Вегетарианский фарш из нута, зеленой чечевицы, фасоли, шампиньонов, овсянки, кукурузного крахмала свеклы и специй, сыр чеддер, булочка бриошь, красный лук, халапеньо, соус баффало, салат микс",
        price: 2200,
        image: "https://i.ibb.co/9pN2Dy9/Screenshot-20210427-185437.jpg",
      },
      {
        id: 10,
        title: "Витаминная смесь",
        description: "Свежая булочка бриошь, куриное филе в панировке и специях, маринованные огурцы, острый соус баффало",
        price: 2200,
        image: "https://i.ibb.co/9pN2Dy9/Screenshot-20210427-185437.jpg",
      },
      {
        id: 11,
        title: "Витаминная смесь",
        description: "Свежая булочка бриошь, куриное филе в панировке и специях, чеддер, томаты",
        price: 2200,
        image: "https://i.ibb.co/9pN2Dy9/Screenshot-20210427-185437.jpg",
      },
      {
        id: 12,
        title: "Витаминная смесь",
        description: "Свежая булочка бриошь, куриное филе в панировке и специях, чеддер, томаты",
        price: 2200,
        image: "https://i.ibb.co/9pN2Dy9/Screenshot-20210427-185437.jpg",
      },
    ],
  },
];
